raw/sysbench-cpubound-10000-fastssd-pareto-psfm32-rocks-small-16-ranges_ro.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Threads started!

setting write concern to 1
[  10s] threads: 16, tps: 94.90, reads: 364.90, writes: 0.00, response time: 227.99ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 16, tps: 97.20, reads: 371.40, writes: 0.00, response time: 218.17ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 16, tps: 96.30, reads: 365.80, writes: 0.00, response time: 221.33ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 16, tps: 93.60, reads: 356.20, writes: 0.00, response time: 219.55ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 16, tps: 94.90, reads: 360.10, writes: 0.00, response time: 220.14ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 16, tps: 92.90, reads: 354.90, writes: 0.00, response time: 221.07ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 16, tps: 95.90, reads: 366.80, writes: 0.00, response time: 221.86ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 16, tps: 93.90, reads: 357.40, writes: 0.00, response time: 221.86ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 16, tps: 93.00, reads: 352.70, writes: 0.00, response time: 223.13ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 16, tps: 94.10, reads: 356.70, writes: 0.00, response time: 220.14ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 16, tps: 94.30, reads: 358.30, writes: 0.00, response time: 219.62ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 16, tps: 95.80, reads: 362.80, writes: 0.00, response time: 221.27ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 16, tps: 94.90, reads: 360.30, writes: 0.00, response time: 221.13ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 16, tps: 97.20, reads: 368.80, writes: 0.00, response time: 222.46ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 16, tps: 96.90, reads: 369.50, writes: 0.00, response time: 220.60ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 16, tps: 95.20, reads: 362.50, writes: 0.00, response time: 219.68ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 16, tps: 97.40, reads: 368.90, writes: 0.00, response time: 219.02ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 16, tps: 94.40, reads: 359.70, writes: 0.00, response time: 220.34ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 16, tps: 95.70, reads: 364.10, writes: 0.00, response time: 223.93ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 16, tps: 95.70, reads: 365.80, writes: 0.00, response time: 224.20ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 16, tps: 95.30, reads: 359.80, writes: 0.00, response time: 223.26ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 16, tps: 94.80, reads: 360.90, writes: 0.00, response time: 221.07ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 16, tps: 95.00, reads: 360.30, writes: 0.00, response time: 224.13ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 16, tps: 95.10, reads: 360.40, writes: 0.00, response time: 221.53ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 16, tps: 95.50, reads: 362.90, writes: 0.00, response time: 218.37ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 16, tps: 93.50, reads: 353.80, writes: 0.00, response time: 222.13ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 16, tps: 94.60, reads: 359.80, writes: 0.00, response time: 225.82ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 16, tps: 94.80, reads: 359.80, writes: 0.00, response time: 223.53ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 16, tps: 95.90, reads: 360.10, writes: 0.00, response time: 220.67ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 16, tps: 94.20, reads: 358.00, writes: 0.00, response time: 223.60ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            108464
        write:                           0
        other:                           28545
        total:                           137009
    transactions:                        28545  (95.09 per sec.)
    read/write requests:                 108464 (361.31 per sec.)
    other operations:                    28545  (95.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.1959s
    total number of events:              28545
    total time taken by event execution: 4801.1886s
    response time:
         min:                                  0.76ms
         avg:                                168.20ms
         max:                                748.45ms
         approx.  95 percentile:             222.00ms

Threads fairness:
    events (avg/stddev):           1784.0625/19.77
    execution time (avg/stddev):   300.0743/0.06