raw/sysbench-iobound-1000-fastssd-pareto-psfm32-rocks-large-48-ranges_ro.txt
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 48
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Initializing worker threads...

Threads started!

[  10s] threads: 48, tps: 1020.39, reads: 3812.67, writes: 0.00, response time: 108.10ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 48, tps: 1376.90, reads: 5126.20, writes: 0.00, response time: 73.25ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 48, tps: 1540.90, reads: 5744.60, writes: 0.00, response time: 60.10ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 48, tps: 1615.90, reads: 6025.90, writes: 0.00, response time: 54.81ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 48, tps: 1686.60, reads: 6289.70, writes: 0.00, response time: 52.53ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 48, tps: 1721.70, reads: 6415.20, writes: 0.00, response time: 51.75ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 48, tps: 1739.50, reads: 6485.80, writes: 0.00, response time: 50.24ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 48, tps: 1749.90, reads: 6521.60, writes: 0.00, response time: 49.94ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 48, tps: 1786.10, reads: 6658.50, writes: 0.00, response time: 47.26ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 48, tps: 1797.60, reads: 6695.20, writes: 0.00, response time: 46.06ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 48, tps: 1801.80, reads: 6718.40, writes: 0.00, response time: 45.98ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 48, tps: 1807.80, reads: 6733.30, writes: 0.00, response time: 44.97ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 48, tps: 1797.30, reads: 6698.10, writes: 0.00, response time: 45.44ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 48, tps: 1818.30, reads: 6774.30, writes: 0.00, response time: 44.93ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 48, tps: 1840.00, reads: 6858.20, writes: 0.00, response time: 43.15ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 48, tps: 1830.10, reads: 6818.50, writes: 0.00, response time: 43.58ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 48, tps: 1844.50, reads: 6873.90, writes: 0.00, response time: 42.61ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 48, tps: 1833.70, reads: 6836.10, writes: 0.00, response time: 43.21ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 48, tps: 1833.60, reads: 6836.40, writes: 0.00, response time: 43.27ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 48, tps: 1837.10, reads: 6847.30, writes: 0.00, response time: 42.62ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 48, tps: 1841.50, reads: 6857.00, writes: 0.00, response time: 43.18ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 48, tps: 1846.10, reads: 6879.70, writes: 0.00, response time: 42.46ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 48, tps: 1840.60, reads: 6852.70, writes: 0.00, response time: 42.36ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 48, tps: 1840.70, reads: 6853.20, writes: 0.00, response time: 42.29ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 48, tps: 1846.40, reads: 6875.00, writes: 0.00, response time: 41.66ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 48, tps: 1847.30, reads: 6889.40, writes: 0.00, response time: 42.25ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 48, tps: 1858.30, reads: 6922.40, writes: 0.00, response time: 41.83ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 48, tps: 1857.10, reads: 6912.00, writes: 0.00, response time: 41.40ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 48, tps: 1868.70, reads: 6959.90, writes: 0.00, response time: 41.21ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 48, tps: 1847.70, reads: 6900.20, writes: 0.00, response time: 41.76ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            1966817
        write:                           0
        other:                           527788
        total:                           2494605
    transactions:                        527788 (1759.18 per sec.)
    read/write requests:                 1966817 (6555.63 per sec.)
    other operations:                    527788 (1759.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0196s
    total number of events:              527788
    total time taken by event execution: 14399.7824s
    response time:
         min:                                  0.59ms
         avg:                                 27.28ms
         max:                                625.30ms
         approx.  95 percentile:              47.42ms

Threads fairness:
    events (avg/stddev):           10995.5833/40.67
    execution time (avg/stddev):   299.9955/0.01